let q1 = +prompt('Сколько будет 2+2?'),
q2 = prompt('Солнце встает на востоке?'),
q3 = prompt('Сколько будет 5 / 0?'),
q4 = prompt('Какого цвета небо?'),
q5 = prompt('Какой правильный ответ на главный вопрос жизни, вселенной и всего такого?');

let res1, res2, res3, res4, res5;

q1 = (q1 == 4) ? res1 = 10: res1 = 0; 
q2 = (q2 == 'Да' || q2 == 'да') ? res2 = 10: res2 = 0; 
q3 = (q3 == '0') ? res3 = 10: res3 = 0; 
q4 = (q4 == 'Голубого' || q4 == 'голубого') ? res4 = 10: res4 = 0; 
q5 = (q5 == 42) ? res5 = 10: res5 = 0; 

let mainResult = res1 + res2 + res3 + res4 + res5;

alert(`
1. ${res1} очков
2. ${res2} очков
3. ${res3} очков
4. ${res4} очков
5. ${res5} очков
Общий результат: ${mainResult} очков
`);